In [ ]:
# Import packages
import numpy as np
import pandas as pd
from scipy import stats  #stat analysis

# 1. Central tendency


![mean-median-mode.jpg](attachment:53122ab7-48ce-4aab-aafb-3494aa5d5bbf.jpg)

## Find the average value of one-bedroom apartments in Manhattan, Brooklyn, Queens

In [ ]:
# Read in housing data
brooklyn = pd.read_csv('2brooklyn.csv')
manhattan = pd.read_csv('2manhattan.csv')
queens = pd.read_csv('2queens.csv')

In [ ]:
# Filter value for one-bedroom
brooklyn['bedrooms'].value_counts() # 340
manhattan['bedrooms'].value_counts() #  1476
queens['bedrooms'].value_counts() #232

bedrooms
1.0    232
2.0    125
0.0     55
3.0     29
4.0      6
1.5      1
Name: count, dtype: int64

In [ ]:
brooklyn_1br = brooklyn[brooklyn['bedrooms'] == 1]
manhattan_1br = manhattan[manhattan['bedrooms'] == 1]
queens_1br = queens[queens['bedrooms'] == 1]
print(len(brooklyn_1br), len(manhattan_1br), len(queens_1br))

340 1476 232

In [ ]:
brooklyn_1br_price = brooklyn.loc[brooklyn['bedrooms'] == 1, 'rent']
manhattan_1br_price = manhattan.loc[manhattan['bedrooms'] == 1, 'rent']
queens_1br_price = queens.loc[queens['bedrooms'] == 1, 'rent']

In [ ]:
print(
    brooklyn_1br_price.head(),
    manhattan_1br_price.head(),
    queens_1br_price.head()
)

3     4900
5     2750
8     2000
9     3200
12    1799
Name: rent, dtype: int64 2     4500
3     4795
9     4650
10    2950
12    4875
Name: rent, dtype: int64 1    1950
2    3500
3    1725
4    1700
7    3100
Name: rent, dtype: int64

**Calculate mean, median, mode for *_price***

In [ ]:
# Add mean Calculations

brooklyn_mean_1br = brooklyn.loc[brooklyn['bedrooms'] == 1, 'rent'].mean()
manhattan_mean_1br = manhattan.loc[manhattan['bedrooms'] == 1, 'rent'].mean()
queens_mean_1br = queens.loc[queens['bedrooms'] == 1, 'rent'].mean()

In [ ]:

print("Brooklyn mean price:", brooklyn_mean_1br)
print("Manhattan mean price:", manhattan_mean_1br)
print("Queens mean price:", queens_mean_1br)

Brooklyn mean price: 2784.855882352941
Manhattan mean price: 3993.4769647696476
Queens mean price: 2346.2543103448274

In [ ]:
#create DataFrame to save mean named avg_price
avg_price = pd.DataFrame({
    'Borough': ['Manhattan', 'Brooklyn', 'Queens'],
    'Avg_price': [
        manhattan_mean_1br,
        brooklyn_mean_1br,
        queens_mean_1br
    ]
})

In [ ]:
round(avg_price,2)

     Borough  Avg_price
0  Manhattan    3993.48
1   Brooklyn    2784.86
2     Queens    2346.25

In [ ]:
# Add median calculations
brooklyn_median = brooklyn.loc[brooklyn['bedrooms'] == 1, 'rent'].median()
manhattan_median = manhattan.loc[manhattan['bedrooms'] == 1, 'rent'].median()
queens_median = queens.loc[queens['bedrooms'] == 1, 'rent'].median()

In [ ]:

print("Brooklyn median:",brooklyn_median)
print("Manhattan median:", manhattan_median )
print("Queens median:", queens_median)

Brooklyn median: 2800.0
Manhattan median: 3800.0
Queens median: 2200.0

In [ ]:
#Create df of median_price

median_price = pd.DataFrame({
    'Borough': ['Manhattan', 'Brooklyn', 'Queens'],
    'Avg_price': [
       brooklyn_median,
       manhattan_median,
       queens_median
    ]
})

In [ ]:
median_price

     Borough  Avg_price
0  Manhattan     2800.0
1   Brooklyn     3800.0
2     Queens     2200.0

In [ ]:
# Add mode calculations

In [ ]:
#Create mode_price DataFrame

# 2. The spread of the data - Variance vs. Standard deviation

## A trip to London - Let's check the weather

In [ ]:

import seaborn as sns

In [ ]:
london_data = pd.read_csv('2london_weather.csv')

In [ ]:
london_data.head()

,date,cloud_cover,sunshine,global_radiation,max_temp,mean_temp,min_temp,precipitation,pressure,snow_depth
0,19790101,2.0,7.0,52.0,2.3,-4.1,-7.5,0.4,101900.0,9.0
1,19790102,6.0,1.7,27.0,1.6,-2.6,-7.5,0.0,102530.0,8.0
2,19790103,5.0,0.0,13.0,1.3,-2.8,-7.2,0.0,102050.0,4.0
3,19790104,8.0,0.0,13.0,-0.3,-2.6,-6.5,0.0,100840.0,2.0
4,19790105,6.0,2.0,29.0,5.6,-0.8,-1.4,0.0,102250.0,1.0

In [ ]:
# Read date type data of date
london_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15341 entries, 0 to 15340
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   date              15341 non-null  int64
 1   cloud_cover       15322 non-null  float64
 2   sunshine          15341 non-null  float64
 3   global_radiation  15322 non-null  float64
 4   max_temp          15335 non-null  float64
 5   mean_temp         15305 non-null  float64
 6   min_temp          15339 non-null  float64
 7   precipitation     15335 non-null  float64
 8   pressure          15337 non-null  float64
 9   snow_depth        13900 non-null  float64
dtypes: float64(9), int64(1)
memory usage: 1.2 MB

In [ ]:
london_data['date'] = pd.to_datetime(
    london_data['date'],
    format='%Y%m%d'
)

london_data['date']

0       1979-01-01
1       1979-01-02
2       1979-01-03
3       1979-01-04
4       1979-01-05
           ...
15336   2020-12-27
15337   2020-12-28
15338   2020-12-29
15339   2020-12-30
15340   2020-12-31
Name: date, Length: 15341, dtype: datetime64[ns]

In [ ]:
london_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15341 entries, 0 to 15340
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   date              15341 non-null  datetime64[ns]
 1   cloud_cover       15322 non-null  float64
 2   sunshine          15341 non-null  float64
 3   global_radiation  15322 non-null  float64
 4   max_temp          15335 non-null  float64
 5   mean_temp         15305 non-null  float64
 6   min_temp          15339 non-null  float64
 7   precipitation     15335 non-null  float64
 8   pressure          15337 non-null  float64
 9   snow_depth        13900 non-null  float64
dtypes: datetime64[ns](1), float64(9)
memory usage: 1.2 MB

In [ ]:
#create cols of year, month, day to save the values
london_data['year'] = london_data['date'].dt.year
london_data['month'] = london_data['date'].dt.month
london_data['day'] = london_data['date'].dt.day

In [ ]:
london_data['year'].unique()

array([1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989,
       1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020])

In [ ]:
# Data for May
may_data = london_data[london_data['month'] == 5]
may_data

,date,cloud_cover,sunshine,global_radiation,max_temp,mean_temp,min_temp,precipitation,pressure,snow_depth,year,month,day
120,1979-05-01,8.0,0.3,86.0,8.0,5.6,3.8,14.2,100280.0,0.0,1979,5,1
121,1979-05-02,5.0,7.2,214.0,10.0,4.6,1.1,1.4,100480.0,0.0,1979,5,2
122,1979-05-03,3.0,9.4,245.0,9.1,4.6,-0.9,0.0,100930.0,0.0,1979,5,3
123,1979-05-04,3.0,9.9,252.0,11.1,4.4,-0.3,0.4,101590.0,0.0,1979,5,4
124,1979-05-05,4.0,9.1,243.0,12.4,6.4,1.7,0.0,102060.0,0.0,1979,5,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...
15122,2020-05-27,6.0,13.0,343.0,26.4,20.0,13.7,0.0,103510.0,NaN,2020,5,27
15123,2020-05-28,2.0,11.2,340.0,22.6,17.1,11.6,0.0,103420.0,NaN,2020,5,28
15124,2020-05-29,1.0,15.4,395.0,24.4,17.7,11.1,0.0,102810.0,NaN,2020,5,29
15125,2020-05-30,0.0,15.7,397.0,25.7,17.8,10.0,0.0,102330.0,NaN,2020,5,30
15126,2020-05-31,0.0,15.3,398.0,25.4,18.9,12.5,0.0,102240.0,NaN,2020,5,31

In [ ]:
london_data.columns

Index(['date', 'cloud_cover', 'sunshine', 'global_radiation', 'max_temp',
       'mean_temp', 'min_temp', 'precipitation', 'pressure', 'snow_depth',
       'year', 'month', 'day'],
      dtype='object')

In [ ]:
# Variance of temperature in May
may_data_var =may_data.loc[may_data['year']>=2015]['mean_temp'].agg(['var','std'])
may_data_var

var    9.092161
std    3.015321
Name: mean_temp, dtype: float64

In [ ]:
# Mean of temperature in May
may_data_mean = may_data.loc[may_data['year']>=2015]['mean_temp'].mean()
round(may_data_mean,2)

14.44

In [ ]:
# Data for June
june_data = london_data[london_data['date'].dt.month == 6]

# Variance of temperature in June
june_data_var = june_data.loc[june_data['year']>=2015]['mean_temp'].agg(['var','std'])
june_data_var

17.62458100558659

In [ ]:
# Mean of temperature in June
june_data_mean = june_data.loc[june_data['year']>=2015]['mean_temp'].mean()
june_data_mean

In [ ]:
# Create df to save Month, Variance, Mean

DATE = pd.DataFrame({
    'Month': ['May','Jun'],
   'Variance': [june_data_var, may_data_var],
    'Mean':[may_data_mean, june_data_mean
    ]
})

DATE

  Month                                           Variance       Mean
0   May  var    7.927145
std    2.815519
Name: mean_tem...  14.444865
1   Jun  var    9.092161
std    3.015321
Name: mean_tem...  17.624581

In [ ]:
print("Average temperature in May: " + str(may_data_mean))
print("Average temperature in Jun: " + str(june_data_mean))
# Temperature in May is cooler than in Jun
print("Standard deviation of temperature in London in May: " + str(may_data_var))
print("Standard deviation of temperature in London in Jun: " + str(june_data_var))
# And the temperature in May is much unstable then in Jun (the standard deviation is larger)

Average temperature in May: 14.444864864864863
Average temperature in Jun: 17.62458100558659
Standard deviation of temperature in London in May: var    9.092161
std    3.015321
Name: mean_temp, dtype: float64
Standard deviation of temperature in London in Jun: var    7.927145
std    2.815519
Name: mean_temp, dtype: float64

# 3. Quartiles, Quantiles, IRQ

Quantiles are values that split a dataset into groups of equal.

**Common Quantiles**  
One of the most common quantiles is the 2-quantile. This value splits the data into two groups of equal size.  
This is also known as the median!

![Common Quantiles](Images/median.svg)

**Quartiles and Interquartile**  
The 4-quantiles, or the quartiles, split the data into four groups of equal size.

![interquartile](Images/interquartile.svg)

The interquartile range is the different between the third (Q3) and the first quartile (Q1). The Q1 is the value that separates the first 25% of the data from the remaining 75%. The Q3 is the opposite - it separates the first 75% of the data from the remaining 25%.
IQR, like the range, helps describe the spread of the center of the data. But, unlike the range, the IQR is robust. A statistics is robust when outliers have little impact on it.

**Percentiles**  
The values that splits the data into 100 groups, are commonly used to compare new data points to the dataset.

![Quartiles](Images/quartiles.svg)

In [ ]:
from scipy.stats import iqr

In [ ]:
dataset = [4, 10, 38, 85, 193]

In [ ]:
#Calculate q1, q3, iqr_range
q1=np.quantile(dataset,0.25)

In [ ]:
q3=np.quantile(dataset,0.75)

In [ ]:
iqr_range =q3-q1

In [ ]:

interquartile_range = iqr(dataset)
interquartile_range

75.0

In [ ]:
# IQR is robust
dataset_one = [6, 9, 10, 45, 190, 200]
dataset_two = [6, 9, 10, 45, 190, 20000000]

In [ ]:
print(iqr(dataset_one), iqr(dataset_two))

144.5 144.5

In [ ]:
print(max(dataset_one) - min(dataset_one))
print(max(dataset_two) - min(dataset_two))

194
19999994